Reflow-Soldering/Learn_bare_metal_driver_development_using_Embedded_C_MCU1/stm32f4xx_drivers/Src/002.LED_Button.c
/*
 * 002.LED_Button.c
 *
 *  Created on: May 21, 2025
 *      Author: user
 */


#include "stm32f407xx.h"

void delay(void)
{
	for(uint32_t i = 0; i< 500000*2; i++);
}

int main(void)
{

	//버튼을 누르면 LED가 켜지고 떼면 꺼짐

	GPIO_Handle_t GpioLed,GpioButton;

	GpioLed.pGPIOx = GPIOD;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_12;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUTPUT;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed = OUTPUT_SPD_VERY_HIGH;

	/*Push Pull 방식일 경우*/

	GpioLed.GPIO_PinConfig.GPIO_PinOPType = OUTPUT_OP_TYPE_PUSH_PULL;
	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PP_PD;

	/*Open Drain 방식일 경우*/

//	GpioLed.GPIO_PinConfig.GPIO_PinOPType = OUTPUT_OP_TYPE_OPEN_DRAIN;
//	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PU;

	GPIO_PeriClockControl(GPIOD, ENABLE);		//클럭 인에이블 진행 후 초기화 하여야 버스에서 레지스터 데이터 전달 가능
	GPIO_Init(&GpioLed);





	GpioButton.pGPIOx = GPIOA;
	GpioButton.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_0;
	GpioButton.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_INPUT;
	GpioButton.GPIO_PinConfig.GPIO_PinSpeed = OUTPUT_SPD_VERY_HIGH;
//	GpioButton.GPIO_PinConfig.GPIO_PinOPType = OUTPUT_OP_TYPE_PUSH_PULL; // 사용 안함
	GpioButton.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PP_PD;

	GPIO_PeriClockControl(GPIOA, ENABLE);

	GPIO_Init(&GpioButton);




	while(1)
	{
		if(GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_0) == SET)
		{
			GPIO_WriteToOutputPin(GPIOD, GPIO_PIN_12, SET);
		}
		else
		{
			GPIO_WriteToOutputPin(GPIOD, GPIO_PIN_12, RESET);
		}
	}
	return 0;
}
